Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Reunion.tmx
Source language: en
Languages: es_419

source: wait, seriously? didn’t i ask you to wait at your place?
es_419: espera, ¿en serio? te dije que yo iría a tu casa.

source: LINES
es_419: dibujos

source: you were really excited for all the things we said we’d do together.
es_419: estabas muy emocionada por todas las cosas que íbamos a hacer juntos.

source: now that you know the truth, do you really like who i am...
es_419: ahora que sabes la verdad, ¿de verdad te agrada como soy…

source: but... i do think about doing things differently sometimes.
es_419: pero… a veces pienso que podría hacer algo distinto.

source: i mean, it’s sure as hell more interesting than stories about snooty customers...
es_419: bueno, seguro que esas historias son más interesantes que las de clientas engreídas…

source: Last night at approximately 10:15 pm, two victims, a woman and a child, were attacked by members belonging to a notorious gang that are known for violent crimes.
es_419: "anoche, alrededor de las 10:15 p. m., una mujer y una niña fueron atacadas por los miembros de una famosa pandilla, conocida por sus crímenes violentos".

source: NO, that came out very wrong! that’s not- NOOOoooooOOo!
es_419: ¡aaaaay, no! ¡no quise decir eso! ¡nooooooo!

source: ooh, look, a two in one deal. jackpot!
es_419: ¡aah, mira! dos por uno. ¡bingo!

source: sure, go for it.
es_419: claro, dime.

source: but i’m getting used to it, i think, and it’s nice to see a familiar face again...
es_419: pero creo que me estoy acostumbrando, y es agradable volver a ver una cara conocida…

source: i ain’t ready to meet jesus, man!
es_419: ¡no estoy listo para ir al cielo!

source: hmm, okay. i’ll take your word for it.
es_419: mmm, bueno. te creo.

source: man, it’s so rowdy at night. has it always been this way?
es_419: caray, qué agitado es esto por la noche. ¿siempre fue así?

source: anyway, there’s this cool pizza place right around the corner, and the best part is they don’t serve veggies!
es_419: hay una pizzería excelente aquí cerca, ¡y lo mejor es que no sirven verduras!

source: ...especially here.
es_419: … y menos por aquí.

source: sorry to worry.
es_419: no te preocupes.

source: Your support means a lot to me, thank you for stopping by and I hope you'll like what you find!
es_419: Tu apoyo significa mucho para mí. ¡Gracias por visitarnos! Espero que disfrutes lo que encontrarás aquí.

source: He's a little dramatic, needs pets and belly scratches to function, so if I'm ever slow to update, blame him.
es_419: Es un poco dramático, necesita que lo acaricien y que le rasquen la barriga, así que si alguna vez tardo en actualizar, es culpa de él.

source: hnng...
es_419: ññññ…

source: yeah, but after the night i put you through, you must have some questions.
es_419: seguro que tendrás preguntas después de la noche que te hice pasar.

source: should i just call a cab then?
es_419: ¿llamaré a un taxi?

source: Created by
es_419: Creado por

source: besides, you’re still better than a certain someone who flaked on us.
es_419: de igual modo, sigues siendo mejor compañía que el que nos dejó plantados.

source: when you see him, he may be a little... tense. just try to be gentle.
es_419: quizá notes que está un poco… tenso. intenta ser amable.

source: wait a minute....
es_419: un momento…

source: so you two go way back, then?
es_419: son viejos amigos, ¿no?

source: okay. fine.
es_419: bien.

source: it’s been so long...
es_419: ha pasado mucho tiempo…

source: ...when we see each other again.
es_419: … cuando volvamos a vernos.

source: okay. just for a little while.
es_419: bien, solo un rato.

source: god, i need to get out of here.
es_419: cielos, debo salir de aquí.

source: hmm, you’re right.
es_419: mm, tienes razón.

source: i didn’t mean to intrude like that.
es_419: no era mi intención molestar.

source: do not make me waste another sunday morning for this purpose ever again, or you will be praying for your death.
es_419: nunca más vuelvan a hacerme perder otra mañana de domingo con estos temas o desearán visitar el otro mundo.

source: sure. come on.
es_419: claro, pasa.

source: ...look what happened.
es_419: … mira lo que pasó.

source: ...the heck...?
es_419: … diablos…?

source: dude, what are you even talking about-
es_419: oye, ¿de qué diablos hablas?

source: i was giving you some genuine advice, how dare you accuse me of such selfish desires, i’m hurt!
es_419: es un consejo sincero. ¿cómo osas acusarme de esconder deseos egoístas? ¡hieres mis sentimientos!

source: wait, you can’t be in there-
es_419: espera, no puedes entrar…

source: yeah... i figured.
es_419: sí, me di cuenta.

source: wait, really? when was that?
es_419: ¿en serio? ¿cuándo?

source: yeah. me too.
es_419: sí, ojalá.

source: ART & STORY BY
es_419: arte e historia:

source: ...this time, it will be different.
es_419: … de que esta vez será diferente.

source: hm?
es_419: ¿mmm?

source: rhea, i think you’ve got some competition.
es_419: rhea, creo que tienes competencia.

source: since you work the night shift all the time, i can’t imagine it’s all that fun.
es_419: no creo que la pases bien trabajando en el horario nocturno todo el tiempo.

source: he’s got the balls, acting all high and mighty.
es_419: qué agallas tiene para hacerse el poderoso.

source: it’s...
es_419: es…

source: it’s really nice to see you again.
es_419: me alegra volver a verte.

source: oh, did you hear back from anyone?
es_419: ah, ¿te respondieron?

source: okay, this is it.
es_419: tengo que hacerlo.

source: honestly. i don’t think i’m built for romance these days.
es_419: sinceramente, ahora no me siento lista para el romance.

source: this... is it?
es_419: ¿es… aquí?

source: it’ll be different.
es_419: ... será diferente.

source: i noticed you got some scratches again, thought it’d be good to have that covered!
es_419: noté que tienes algunos rasguños. ¡pensé que esto podría ser útil!

source: oh, NO, nothing like that.
es_419: oh, no, no es nada de eso.

source: no, i get that. i just wish you didn’t have to go so far away.
es_419: sí, lo entiendo, pero ojalá no fuera tan lejos.

source: ...something has changed.
es_419: ... que algo había cambiado.

source: hmm...
es_419: mmm…

source: i noticed... you get cuts around your hands a lot. what happened?
es_419: noté que… sueles tener cortes ahí. ¿qué te pasó?

source: oh, n-no problem!
es_419: ¡n-no hay problema!

source: i did not say that-
es_419: yo no dije…

source: yeah, the movie ended awhile ago. i guess you were asleep for half of it.
es_419: sí, la película terminó hace un rato. creo que te perdiste la mitad.

source: hnnnggg...
es_419: aaaauuch…

source: oh, i’m surprised you answered. where are you now?
es_419: vaya, me sorprendió que respondieras. ¿dónde estás?

source: no, i don’t think so. we don’t do that sort of stuff.
es_419: no lo creo. no solemos hacer esas cosas.

source: are you sure? he doesn’t really look the part though...
es_419: ¿en serio? él no lo parece, la verdad…

source: i...
es_419: yo…

source: thank you for telling me all this.
es_419: gracias por decírmelo.

source: YOU.
es_419: eh, tú.

source: who are you here for? kira? kai?
es_419: ¿vienes a ver a kira? ¿a kai?

source: ...i was so worried about you.
es_419: … estaba tan preocupada por ti.

source: i need a long walk.
es_419: necesito un paseo.

source: geez, you do this all the time! don’t play dumb with me-
es_419: ey, ¡lo haces todo el tiempo! no te hagas el distraído…

source: but i think i know who you are.
es_419: pero creo que sé quién eres.

source: last night? no, i haven’t.
es_419: ¿de anoche? no sabía nada.

source: please... i want to go home...
es_419: por favor… quiero ir a mi casa…

source: yeah! i never noticed that about you. i bet girls like you for that.
es_419: ¡sí! no lo había notado antes. apuesto que a las chicas les encanta.

source: sometimes, we do it to protect the people who need it most.
es_419: a veces, lo hacemos para proteger a personas que lo necesitan.

source: yeah, just about an hour ago.
es_419: hace más o menos una hora.

source: though let’s be real, judging by all that i’m hearing, no one has got anything on these guys.
es_419: pero seamos realistas, todo lo que escucho me dice que nadie sabe nada sobre esos tipos.

source: it’s shiro.
es_419: es shiro.

source: let go!
es_419: ¡suéltame!

source: you’re not who you used to be, but you’re better, and i think i’d like to get to know you all over again.
es_419: no eres quien eras, eres mejor, y creo que me gustaría volver a conocerte.

source: i guess you’re not the same boy i grew up with anymore.
es_419: supongo que ya no eres el niño con el que crecí.

source: oh.
es_419: ah.

source: well, i can respect the craft. that’s how my ma is like with hair!
es_419: ah, yo respeto a la gente con vocación. ¡así es mi ma con el pelo!

source: huh. he’s still not back yet?
es_419: ¿aún no volvió?

source: ow, what the hell...?!
es_419: ¡¿pero qué demonios…?!

source: that’s your question?
es_419: ¿esa es tu pregunta?

source: alright... play time is over...
es_419: bien, basta de juegos…

source: so you don’t know anyone here, then?
es_419: entonces no conoces a nadie, ¿no?

source: so you don’t know.
es_419: así que no lo sabes.

source: i didn’t know where you went, or if you were okay, not even a simple text to let me know you’re fine.
es_419: no sabía adónde habías ido ni si estabas bien. no enviaste un solo mensaje para decirme que estabas vivo.

source: well... what do you think?
es_419: ¿qué piensas tú sobre eso?

source: thanks, rhea! i owe ya big time. i’ll see you tomorrow!
es_419: ¡gracias, rhea! te debo una. ¡hasta mañana!

source: Brb gotta go pet my dog-
es_419: Ya vuelvo. Tengo que ir a malcriar a mi perro.

source: the rumored vigilante, who some believe is a work of fiction, has been making headlines in a series of similar incidents.
es_419: "el supuesto justiciero, que algunos consideran una figura de ficción, ha protagonizado titulares por una serie de incidentes similares".

source: so... right after that?
es_419: ¿después de eso?

source: ...looked like you had so much to say.
es_419: … transmitía que deseas expresar algo.

source: oh, sorry, i don’t think i introduced myself...?
es_419: ah, perdón, creo que no le dije mi nombre…

source: i hear you.
es_419: comprendo.

source: did i just ask her out?
es_419: ¿la invité a salir?

source: but now that you know what i do, if i get caught, they might come for you too, and you’re okay with that?
es_419: pero ahora que sabes lo que hago, si me atrapan, podrían intentar ir por ti, ¿eso no te afecta?

source: CUT IT OUT, OLD MAN!
es_419: ¡para ya, viejo!

source: maybe we can start with that.
es_419: quizá podamos empezar desde aquí.

source: so if i’m going down, you two are coming with me!
es_419: si voy a perder, ¡ustedes también perderán!

source: ah, that’s okay. thanks...
es_419: ah, lo entiendo. gracias…

source: um, i-i think i’m fine, but the girl-
es_419: creo que sí, pero la niña…

source: no, stay back!
es_419: ¡no, aléjate!

source: oh please, save me the lecture. everyone can be a cheater, some just don’t get caught!
es_419: oh, vamos, ahórrame el discursito. todos engañan, ¡solo que algunos son más disimulados!

source: DAMMIT, don’t ever scare me like that again!
es_419: ¡maldición! ¡no vuelvas a aterrorizarme así!

source: shiro, i’ve been trying to reach you for hours!
es_419: shiro, ¡he tratado de ubicarte durante horas!

source: that doesn’t make you a criminal, does it?
es_419: eso no te convierte en un criminal, ¿verdad?

source: well, you remember way back when there were rumors of this mob family going around?
es_419: bueno, cuando vivías aquí circulaban unos rumores sobre una familia mafiosa, ¿recuerdas?

source: um...
es_419: emm…

source: that’s a promise!
es_419: ¡es una promesa!

source: that voice...
es_419: la voz…

source: i said back off!
es_419: ¡ya déjame en paz!

source: y’know, the one from the news today?
es_419: ya sabes, los del noticiero.

source: he... did?
es_419: ¿l-lo hizo?

source: i wonder if he’s used to getting all this attention now, or does he not notice?
es_419: ¿se habrá acostumbrado a recibir tanta atención o no se dará cuenta?

source: ah, well... my family is moving, it doesn’t make sense if i don’t go with them, does it?
es_419: ah, bueno… toda mi familia se muda. debo ir con ellos, ¿no?

source: we lost touch when i moved away, so we’re not as close as we could be i guess?
es_419: perdimos el contacto cuando me mudé, así que no somos tan cercanos como podríamos.

source: don’t leave him behind!
es_419: ¡no lo abandonen!

source: and you appear to be the only one who has all the answers.
es_419: y tú pareces ser la única que tiene todas las respuestas.

source: oh-
es_419: ah…

source: because that version of me you hold on to, the one you said goodbye to at the carnival...
es_419: porque esa versión mía con la que te quedaste, a la que dijiste "adiós" en la feria…

source: asleep? you were hurt, and you ran off before anyone could help you!
es_419: ¿durmiendo? ¡estabas herido y huiste antes de que pudieran ayudarte!

source: huh?
es_419: ¿cómo?

source: so what’s stopping you?
es_419: ¿qué te detiene?

source: here! i know it’s not exactly your style, but i think it suits you, and it’s something to remember me by!
es_419: ¡toma! sé que no es tu estilo, pero creo que te sienta bien, ¡y es algo para recordarme!

source: now, regarding our surprise house guests...
es_419: y en relación con los visitantes inesperados…

source: but everything about me and my family spells trouble. aren’t you afraid?
es_419: pero todo lo que nos rodea garantiza problemas. ¿no tienes miedo?

source: okay, do you want to talk about it?
es_419: ¿quieres que lo hablemos?

source: we’re hired to do things others wouldn’t do, all the dirty work... jobs that need to be handled in secret.
es_419: nos contratan para hacer lo que otros no harían, el trabajo sucio… cosas que deben hacerse en secreto.

source: y-yeah, i’m fine, i was just a little spooked...
es_419: s-sí. solo me asusté un poco…

source: either ways, i’ll be back to visit some time, i’m sure of it!
es_419: como sea, seguro vendré a visitarte en algún momento.

source: do you really have to go?
es_419: ¿en serio tienes que irte?

source: you’re not from around here, are you?
es_419: no eres de por aquí, ¿verdad?

source: HEY, know your place!
es_419: ¡oye, pórtate bien!

source: oh, shit-
es_419: m*erda…

source: i know he can be a little hard to read, i... feel the same way too.
es_419: sé que puede ser un poco cerrado. yo… también lo creo.

source: i mean... i was never honest with you before, i was never honest with anyone, and look where that got me.
es_419: lo que quiero decir es que… no fui sincero contigo ni con nadie, y mira adónde me llevó esa actitud.

source: those eyes...
es_419: esos ojos…

source: you know, it’s really uncommon for a girl to be out this late at night.
es_419: ¿sabes? es muy poco común que una chica salga tan tarde en la noche.

source: ...waiting for someone? like... a date?
es_419: … esperando a alguien? como… ¿una cita?

source: so for your sake, i’d stay as far away as possible.
es_419: así que, por tu bien, mantente alejada.

source: basically, it’s not safe to be out alone anymore.
es_419: en resumen, ya no es seguro andar solo.

source: so... i’ll see you later? just be careful.
es_419: entonces… ¿nos vemos luego? ten cuidado.

source: are you sure that’s allowed?
es_419: ¿seguro que lo permiten?

source: everything we’ve done... it’s already in our name.
es_419: lo que ya hicimos… está grabado en nuestro nombre.

source: a-ah, um... sorry, what were we talking about?
es_419: a-ah, mm… lo siento, ¿de qué hablábamos?

source: no one knows, but i sure think so.
es_419: quién sabe. yo lo creo.

source: yeah, i noticed.
es_419: sí, me di cuenta.

source: oh. yeah. i just had to run some errands.
es_419: eh, sí. tenía un par de cosas que hacer.

source: thank you, rhea.
es_419: gracias, rhea.

source: i got the girl, she’s wounded but nothing too serious. she mentioned another man who ran off-
es_419: tengo a la chica. está herida, pero no es grave. ella mencionó a un hombre que escapó…

source: a word? we have something to discuss before we all go on with our day.
es_419: ¿un minuto? debemos hablar antes de empezar a ocuparnos de otras cosas.

source: shit...
es_419: mierda…

source: i have something for you.
es_419: tengo algo para ti.

source: um, i-i’m sorry but i need to get out of here-
es_419: mm, p-perdona, pero debo irme de aquí…

source: he’s reserved and doesn’t speak his mind much. he never talks about how he feels, and he has always been that way since we were younger.
es_419: es reservado, no suele decir lo que piensa ni cómo se siente. siempre ha sido así, desde que era un niño.

source: it’s okay, i insist! treat it as a thank you for dinner yesterday.
es_419: ¡está bien, insisto! será mi agradecimiento por la cena de anoche.

source: somebody...
es_419: que alguien…

source: thanks! though all my friends aren’t from the city... but i’ll keep that in mind?
es_419: ¡gracias! lástima que ellas no vivan en la ciudad… pero lo tendré en cuenta.

source: i’m sorry i missed your calls, okay?
es_419: perdón por no responder tus llamadas.

source: so let’s start all over again, from the beginning, sound good?
es_419: así que ¿te parece bien si empezamos desde el principio?

source: i guess we can pretend this never happened for now, and we’ll go back to normal, it’s fine.
es_419: por ahora podemos hacer de cuenta que esto no ocurrió y volver a la normalidad.

source: bas, are you feeding a whole village with that?
es_419: bas, ¿alimentarás a un pueblo entero?

source: sometimes i think maybe i should have, but if i did…
es_419: a veces creo que debería haberlo escuchado, pero…

source: en_US
es_419: es_LATAM

source: so... did you get it done?
es_419: ¿y ya lo hiciste?

source: you can’t actually believe you’re just a toy to me.
es_419: no es posible que creas que te considero un juguete.

source: shiro is not who you think he is. he’s dangerous.
es_419: shiro no es lo que crees. es peligroso.

source: last night? no, i just thought he was with you.
es_419: ¿anoche? no. pensé que estaba contigo.

source: you should’ve at least discussed with me before letting a stranger into our home.
es_419: deberías haber consultado conmigo antes de dejar entrar a una extraña en la casa.

source: yeah, well...she’s not my girlfriend.
es_419: sí, bueno… no es mi novia.

source: but... i also just learned that a good friend of mine can probably take on anyone who tries to come my way.
es_419: pero… también me acabo de enterar de que un buen amigo mío podría darle una tunda a quien intente hacerme daño.

source: yo, Rhea, for real? how’ve you been?
es_419: ey, rhea, ¿en serio eres tú? ¿qué tal?

source: did it not_x0003_occur to you that i simply wasn’t checking my phone at this hour, maybe i was asleep?
es_419: ¿no se te ocurrió que podría estar durmiendo y que no iba a revisar el teléfono a esa hora?

source: she’s leaving?
es_419: ¿ella se va?

source: thankfully, it appears that the injury you sustained on your head is not too serious, though it is strongly recommended that you take a few days off to rest.
es_419: por suerte, la lesión que recibiste en la cabeza no es grave, pero es muy importante que te tomes unos días libres para descansar.

source: you are of age now, shiro. it’s time you claim the full responsibility of your role in this family.
es_419: ya eres mayor de edad, shiro. debes asumir toda la responsabilidad de tu rol en esta familia.

source: we could meet on purpose if you want.
es_419: podríamos encontrarnos a propósito.

source: i said don’t touch me!
es_419: ¡dije que no me toques!

source: i can’t find my daddy, and these big scary people are following me-
es_419: no encuentro a papá y esas personas grandes y malas me están siguiendo…

source: i wasn’t exactly planning to move back here, but there’s just so much more to do in the city for younger ones like us, y’know?
es_419: no planeaba regresar, pero en la ciudad hay muchas más cosas que los jóvenes podemos hacer, ¿sabes?

source: OBASI? you guys are still in contact? no way, it’s been ages!
es_419: ¿obasi? ¿siguen en contacto? ¡qué increíble, han pasado años!

source: aw, c’mon, it can’t be that bad. i wanna hear it!
es_419: oh, vamos, no puede ser tan malo. ¡cuéntame!

source: yeah. see ya.
es_419: bien, nos vemos.

source: don’t touch me!
es_419: ¡no me toques!

source: ah, we take tea very seriously in this house.
es_419: es que aquí preparar el té es un arte.

source: STAB
es_419: FUP

source: ...hello?
es_419: … ¿hola?

source: i’d suggest you pack up and leave, but no way in hell am i letting you go that easily this time.
es_419: te recomiendo que te vayas, pero no creas que será tan fácil esta vez.

source: by the way...
es_419: por cierto…

source: so you guys moved in together, huh. what else have you been up to these days?
es_419: así que se mudaron juntos. ¿qué más has estado haciendo en este tiempo?

source: well, i gotta go meet kori.
es_419: sí, tengo que ir a ver a kori.

source: eh, doesn’t matter, you can never have too many dips.
es_419: eh, no importa, siempre es bueno tener de más.

source: gosh... i know people can change, but he was so different when we were younger...
es_419: cielos, sé que la gente puede cambiar, pero él era tan distinto hace unos años…

source: haha, you’re sick.
es_419: ja, ja. estás enfermo.

source: ah... did you?
es_419: ah, ¿en serio?

source: please make yourselves at home. we’ll be right back.
es_419: siéntanse como en casa. volveremos enseguida.

source: your carelessness led to your injury, and now our family secret is compromised.
es_419: te hirieron por descuidarte, y ahora nuestro secreto familiar está en peligro.

source: right... so um, about that...
es_419: bien… entonces, sobre eso…

source: that’s not even a reason!
es_419: ¡esa no es una excusa!

source: ...hm?
es_419: … ¿mm?

source: not gonna lie, i’m a little impressed.
es_419: no voy a mentirte, me impresionas.

source: it’s obvious that you both care about each other a lot.
es_419: es obvio que ambos están muy interesados en el otro.

source: i know everyone was acting cool about the whole thing, but it was still embarrassing to be found like that...
es_419: todos hicieron como que no pasaba nada, pero igual fue una vergüenza que me encontraran así…

source: know him? are you blind?!
es_419: ¿si lo conozco? ¿estás ciego?

source: think of us as a business that runs errands. yeah, that’s it.
es_419: es como un negocio que hace recados. sí, eso.

source: HUH?
es_419: ¿eeh?

source: okay. thank you.
es_419: bien, gracias.

source: ...i swear i’ve seen him before.
es_419: … juro que lo he visto antes.

source: ah... m-maybe?
es_419: eh… t-tal vez.

source: ...is not what he makes it out to be.
es_419: … no es lo que afirma.

source: i know it’s not much, but i thought it’d be fun...
es_419: no es mucho, pero creí que sería divertido…

source: uh...
es_419: eh…

source: 11 years ago...
es_419: 11 años antes…

source: are they following me?
es_419: ¿me están siguiendo?

source: ...and i don’t want to do this anymore.
es_419: … y ya no quiero hacer esto.

source: well, thanks for hanging out, i hope it wasn’t too boring.
es_419: bueno, gracias por venir. espero que no te hayas aburrido.

source: no, not yet, but i’m bound to hear back from at least one of them though, right?
es_419: no, aún no, pero estoy segura de que al menos uno contestará.

source: then... mind if i ask you a question?
es_419: entonces… ¿puedo preguntarte algo?

source: i’m on the way to your apartment. i’ll be there any minute now.
es_419: camino a tu apartamento. estaré ahí en un minuto.
